app/Http/Services/StatisticService.php

  private function monthlyFixes():int
  {
    return Action::where(function($q){
      $q->where('current_status', Item::ITEM_WARRANTED_FIX)->orWhere('current_status', Item::ITEM_UNWARRANTED_FIX);
    })->where('created_at', '>=', date("Y-m-01"))->count();
---
SELECT count(*) as aggregate FROM `items` WHERE `status` != 'deleted' and `status` = 'in_use'
SELECT count(*) as aggregate FROM `actions` WHERE (`current_status` = 'warranted_fix' or `current_status` = 'unwarranted_fix') and `created_at` >= '2019-01-01'

  private function monthlyRentCost()
  {
    $date = date("Y-m-01");
    $cost = 0;
    $items = RentedItem::where('created_at', '>=', date("Y-01-01"))->get();
---
SELECT * FROM `rented_items` WHERE `created_at` >= '2019-01-01'